<?php
    echo "Занятие 1-3a <br/><br/>";
    $a = 4;
    $b = 6;
    $c = 3;
    $d = 8;
    $p = $a + $b + $c + $d;
    echo "Периметр четырехугольника равен $p";

    echo "<hr/>";



    echo "Занятие 1-3b <br/><br/>";
    $x = 0.5;
    $a = 7 * $x;
    $b = 21 * $x;
    $S = ($a + $b) * ($a + $b);
    echo "S равно $S";

    echo "<hr/>";



    echo "Занятие 1-4a <br/><br/>";
    $why = true;
    $a = 4;
    $b = 3;
    $c = 2;
    $d = 2;
    $h = 2;

    if ($why == true) {
        $E = (($a + $b) / 2) * $h;
        echo "Площадь трапеции равна $E";
    }
    else {
        $E = $a + $b + $c + $d;
        echo "Периметр трапеции равен $E";
    }

    echo "<hr/>";



    echo "Занятие 1-4b <br/><br/>";
    $why = false;
    $a = 20;
    $b = 8;
    $c = 10;
    $d = 10;
    $h1 = 8;

    $x = (pow(($a - $b), 2) + pow($c, 2) - pow($d, 2)) / (2 * ($a - $b));
    $h2 = sqrt(pow($c, 2) - pow($x, 2));

    if ($why == true && $a > $b && $h1 == $h2)  {
        $S = (($a + $b) / 2) * $h1;
        echo "Площадь трапеции равна $S";
    }
    else if ($a > $b && $h1 == $h2) {
        $P = $a + $b + $c + $d;
        echo "Периметр трапеции равен $P";
    }
    else {
        echo "Введены некорректные данные";
    }
    echo "<hr/>";



    echo "Занятие 1-5a <br/><br/>";

    $optimist = 0;
    $pessimist = 0;

    for ($i = 0; $i < 100; $i += 1) {
        $computer = rand(0, 1);

        if ($computer == 1) {
            $optimist += 1;
        }
        else {
            $pessimist += 1;
        }
    }
    echo "Сейчас компьютер на $optimist% оптимист и на $pessimist% пессимист";

    echo "<hr/>";



    echo "Занятие 1-5b <br/><br/>";

    $password = "003710";

    for ($i = 0; $i < 1000000; $i++) {
        if ($i == $password) {      // подбираем i равное num. //если в начале пароля имеются нули, то нам нужно узнать их кол-во
            if (strlen($i) < 6) {   // здесь длина числа i равна 4, а значит она меньше 6(длины строки с паролем)
                $zero_count = 6 - strlen($i);  // кол-во нолей в начале будет равно двум

                $j = 1;        // итератор цикла while
                $string_password = '';  // строка в которую запишем все необходимые нам нули
                while ($j <= $zero_count) {  // цикл выполнится 2 раза, когда j = 1 и 2. потому что $zero_count равно 2 в на шем случае
                    $string_password .= '0'; // соотвественно в $string_password конктатенируем 2 нуля
                    $j++; // итератор увеличиваем на 1 в конце цикла
                }

                echo "Пароль: ".$string_password.$i."<br/>";  // теперь сложим наши нули с числом подобраным в цикле for и выведем наш пароль
            }
            else {
                echo "Пароль: ".$i."<br/>";  // в случае если в начале пароля нет нулей, то просто выводим подобранное число и игнорируем код с 84 по 94 строки
            }
        }
    }

    echo "<hr/>";

    echo "Занятие 1-5c <br/><br/>";

    $pass1 = "436";
    $pass2Se = "123";  // шифр

    $hack = ($pass1 - 406) / 10;  // найдем 2 разряд пароля pass1

    $pass2Se1 = ($pass2Se - 23) / 100;  // найдем 1 разряд шифра
    $pass2Se2 = ($pass2Se - 103) / 10;  // найдем 2 разряд шифра
    $pass2Se3 = $pass2Se - 120;         // найдем 3 разряд шифра

    if ($hack > 5) {   // если 2 разряд pass1 больше 5
      echo "Пароль pass2 - ".$pass2Se1.$pass2Se2.$pass2Se3; // то pass2 будет: 1 разряд шифра + 2 разряд шифра + 3 разряд шифра
    }
    else {   // если 2 разряд pass1 меньше или равно 5
      echo "Пароль pass2 - ".$pass2Se2.$pass2Se3.$pass2Se1; // то pass2 будет: 2 разряд шифра + 3 разряд шифра + 1 разряд шифра
    }

    echo "<hr/>";

    echo "Занятие 1-5d <br/><br/>";

    if ($pass1 == "436") {   // если 2 разряд pass1 больше 5
      echo "Шифр - ".$pass2Se1.$pass2Se2.$pass2Se3;
    }

    echo "<hr/>";

    echo "Занятие 1-6a <br/><br/>";

    $a = "семь";
    $b = "четыре";
    $c = 0;

    if ($a == "ноль" or $b == "ноль") {
      $c += 0;
    }
    if ($a == "один" or $b == "один") {
      $c += 1;
    }
    if ($a == "два" or $b == "два") {
      $c += 2;
    }
    if ($a == "три" or $b == "три") {
      $c += 3;
    }
    if ($a == "четыре" or $b == "четыре") {
      $c += 4;
    }
    if ($a == "пять" or $b == "пять") {
      $c += 5;
    }
    if ($a == "шесть" or $b == "шесть") {
      $c += 6;
    }
    if ($a == "семь" or $b == "семь") {
      $c += 7;
    }
    if ($a == "восемь" or $b == "восемь") {
      $c += 8;
    }
    if ($a == "девять" or $b == "девять") {
      $c += 9;
    }
    echo $c."<br/>";
    if (strlen($c) == 1) {
      echo "Маленькое число";
    }
    else {
      echo "Большое число";
    }

    echo "<hr/>";

    echo "Занятие 1-6b <br/><br/>";

    $price = 10050;
    $price2 = $price + ($price / 100 * 13) - (($price * 13) % 100 / 100);
    $N = $price2 % 100;
    $M = ($price2 - $N) / 100;

    echo $M." рубл[ей/я] ".$N." копе[ек/йки]<br/>";
    echo $M.".".$N;


    echo "<hr/>";

    echo "Занятие 1-6c <br/><br/>";

    
?>
